lib/tasks/genre_create.rake

INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Eletronica"], ["created_at", "2025-01-29 17:48:35.247226"], ["updated_at", "2025-01-29 17:48:35.247226"]]
SELECT "genres".* FROM "genres" WHERE "genres"."name" = $1 LIMIT $2  [["name", "Eletronica"], ["LIMIT", 1]]
---
  task create: :environment do
    genres = %w[Eletronica Jazz Metal Pop Rock MPB]
    genres.each do |genre|
      Genre.find_or_create_by(name: genre)