app/views/tracks/index.html.erb

SELECT "genres".* FROM "genres"
---

    genresForm.addEventListener("submit", function(e) {
      // Pega todos os checkboxes marcados
      const checkedBoxes = document.querySelectorAll(".genre-checkbox:checked");
      // Extrai os valores e transforma em array
      const valuesArray = Array.from(checkedBoxes).map(cb => cb.value);
      // Junta os valores em uma string separada por vírgulas
      genresInput.value = valuesArray.join(",");
      // Com isso, o form submete ?genres=1,2,3,4
    });