app/views/albums/_form.html.erb

  <div id="genre_checkboxes">
    <% Genre.all.each do |genre| %>
      <div class="mb-2">
        <%= check_box_tag 'album[genre_ids][]', genre.id, album.genres.include?(genre), id: "genre_#{genre.id}", class: "genre-checkbox" %>
---
SELECT "genres".* FROM "genres"
SELECT 1 AS one FROM "genres" INNER JOIN "album_genres" ON "genres"."id" = "album_genres"."genre_id" WHERE "album_genres"."album_id" = $1 AND "genres"."id" = $2 LIMIT $3  [["album_id", 1], ["id", 1], ["LIMIT", 1]]