app/controllers/albums_controller.rb

  def index
    if current_user.role == 'listener'
      redirect_to tracks_path
      return
    end

    @albums = Album.where(user: current_user)
---
SELECT "albums".* FROM "albums" WHERE "albums"."user_id" = $1  [["user_id", 1]]

  def create
    @album = Album.new(album_params)

    respond_to do |format|
      if @album.save
---
INSERT INTO "albums" ("title", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Disney songs"], ["description", "musicas da disney que eu gosto"], ["created_at", "2025-01-29 17:51:20.518826"], ["updated_at", "2025-01-29 17:51:20.518826"], ["user_id", 1]]

  def destroy
    @album.destroy!
---
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 7]]