app/controllers/auth_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "matheus@gmail.com"], ["LIMIT", 1]]
---
  def sign_in_post
    @user = User.find_by(email: user_params[:email])

INSERT INTO "users" ("name", "email", "password_digest", "role", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def sign_up_post
    if user_params[:password] != user_params[:password_confirmation]
      redirect_to sign_up_path, notice: 'Senhas não conferem'
      return
    end

    @user = User.new(user_params)

    if @user.save