app/controllers/tracks_controller.rb

SELECT "genres".* FROM "genres"
---
  def index
    @tracks = filtered_tracks
    @genres = Genre.all

INSERT INTO "tracks" ("name", "link", "album_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "moana"], ["link", "https://www.youtube.com/watch?v=mUVUmG9vOFw"], ["album_id", 1], ["created_at", "2025-01-29 17:51:44.386690"], ["updated_at", "2025-01-29 17:51:44.386690"]]
---
  def create
    @track = Track.new(track_params)

    respond_to do |format|
      if @track.save

DELETE FROM "tracks" WHERE "tracks"."id" = $1  [["id", 2]]
---
  def destroy
    @track.destroy!

SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_album
      @album = Album.find(params[:album])

SELECT "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_track
      @track = Track.find(params[:id])